#!/bin/bash

# =============================================================================
# Скрипт для компиляции и трассировки программ с использованием sigaction()
# =============================================================================
# Цели:
# 1. Скомпилировать программы 3.1 и 3.2
# 2. Запустить программы с трассировкой системных вызовов, связанных с сигналами
# 3. Проанализировать результаты трассировки для понимания работы sigaction()
#
# Особенности реализации:
# - Использование strace для отслеживания системных вызовов
# - Трассировка только системных вызовов, связанных с сигналами
# - Раздельный запуск тестов для программ 3.1 и 3.2
#
# Выводы:
# 1. strace позволяет детально отслеживать системные вызовы
# 2. Анализ трассировки помогает понять работу sigaction() и других функций
#    для управления сигналами
# =============================================================================


cd 3
gcc -o 3.1 3.1.c
gcc -o 3.2 3.2.c
echo "=============================================="
echo "                  ЗАДАНИЕ 3.1                 "
echo "=============================================="
strace -tt -e 'trace=signal,kill,tgkill,tkill,sigaction,sigprocmask' -f ./3.1

echo -e "\n=============================================="
echo "                  ЗАДАНИЕ 3.2                 "
echo "=============================================="

strace -tt -e 'trace=signal,kill,tgkill,tkill,sigaction,sigprocmask' -f ./3.2
rm 3.1 3.2